zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT118C/MIMXRT118C_cm33_COMMON.h
/* FLEXSPI - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral FLEXSPI1 base address */
  #define FLEXSPI1_BASE                            (0x525E0000u)
  /** Peripheral FLEXSPI1 base address */
  #define FLEXSPI1_BASE_NS                         (0x425E0000u)
  /** Peripheral FLEXSPI1 base pointer */
  #define FLEXSPI1                                 ((FLEXSPI_Type *)FLEXSPI1_BASE)
  /** Peripheral FLEXSPI1 base pointer */
  #define FLEXSPI1_NS                              ((FLEXSPI_Type *)FLEXSPI1_BASE_NS)
  /** Peripheral FLEXSPI2 base address */
  #define FLEXSPI2_BASE                            (0x545E0000u)
  /** Peripheral FLEXSPI2 base address */
  #define FLEXSPI2_BASE_NS                         (0x445E0000u)
  /** Peripheral FLEXSPI2 base pointer */
  #define FLEXSPI2                                 ((FLEXSPI_Type *)FLEXSPI2_BASE)
  /** Peripheral FLEXSPI2 base pointer */
  #define FLEXSPI2_NS                              ((FLEXSPI_Type *)FLEXSPI2_BASE_NS)
  /** Array initializer of FLEXSPI peripheral base addresses */
  #define FLEXSPI_BASE_ADDRS                       { 0u, FLEXSPI1_BASE, FLEXSPI2_BASE }
  /** Array initializer of FLEXSPI peripheral base pointers */
  #define FLEXSPI_BASE_PTRS                        { (FLEXSPI_Type *)0u, FLEXSPI1, FLEXSPI2 }
  /** Array initializer of FLEXSPI peripheral base addresses */
  #define FLEXSPI_BASE_ADDRS_NS                    { 0u, FLEXSPI1_BASE_NS, FLEXSPI2_BASE_NS }
  /** Array initializer of FLEXSPI peripheral base pointers */
  #define FLEXSPI_BASE_PTRS_NS                     { (FLEXSPI_Type *)0u, FLEXSPI1_NS, FLEXSPI2_NS }
#else
  /** Peripheral FLEXSPI1 base address */
  #define FLEXSPI1_BASE                            (0x425E0000u)
  /** Peripheral FLEXSPI1 base pointer */
  #define FLEXSPI1                                 ((FLEXSPI_Type *)FLEXSPI1_BASE)
  /** Peripheral FLEXSPI2 base address */
  #define FLEXSPI2_BASE                            (0x445E0000u)
  /** Peripheral FLEXSPI2 base pointer */
  #define FLEXSPI2                                 ((FLEXSPI_Type *)FLEXSPI2_BASE)
  /** Array initializer of FLEXSPI peripheral base addresses */
  #define FLEXSPI_BASE_ADDRS                       { 0u, FLEXSPI1_BASE, FLEXSPI2_BASE }
  /** Array initializer of FLEXSPI peripheral base pointers */
  #define FLEXSPI_BASE_PTRS                        { (FLEXSPI_Type *)0u, FLEXSPI1, FLEXSPI2 }
#endif
/** Interrupt vectors for the FLEXSPI peripheral type */
#define FLEXSPI_IRQS                             { NotAvail_IRQn, FLEXSPI1_IRQn, FLEXSPI2_IRQn }
/** FlexSPI AMBA memory base alias count */
#define FLEXSPI_AMBA_BASE_ALIAS_COUNT     (2)
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2)) || defined(ROM_ENABLE_CMSE)
  /* FlexSPI AMBA base address array. */
  #define FlexSPI_AMBA_BASE_ARRAY                  { {0u, 0u}, {0x38000000u, 0x12000000u}, {0x14000000u, 0x32000000u} }
  #define FlexSPI_AMBA_BASE_ARRAY_NS               { {0u, 0u}, {0x28000000u, 0x2000000u}, {0x4000000u, 0x22000000u} }
  /* FlexSPI AMBA end address array. */
  #define FlexSPI_AMBA_END_ARRAY                   { {0u, 0u}, {0x3FFFFFFFu, 0x13FFFFFFu}, {0x17FFFFFFu, 0x33FFFFFFu} }
  #define FlexSPI_AMBA_END_ARRAY_NS                { {0u, 0u}, {0x2FFFFFFFu, 0x3FFFFFFu}, {0x7FFFFFFu, 0x23FFFFFFu} }
  /* FlexSPI1 AMBA address. */
  #define FlexSPI1_AMBA_BASE                       (0x38000000u)
  #define FlexSPI1_AMBA_BASE_NS                    (0x28000000u)
  /* FlexSPI1 ASFM address. */
  #define FlexSPI1_ASFM_BASE                       (0x38000000u)
  #define FlexSPI1_ASFM_BASE_NS                    (0x28000000u)
  /* Base Address of AHB address space mapped to IP RX FIFO. */
  #define FlexSPI1_ARDF_BASE                       (0x57420000u)
  #define FlexSPI1_ARDF_BASE_NS                    (0x47420000u)
  /* Base Address of AHB address space mapped to IP TX FIFO. */
  #define FlexSPI1_ATDF_BASE                       (0x57430000u)
  #define FlexSPI1_ATDF_BASE_NS                    (0x47430000u)
  /* FlexSPI2 AMBA address. */
  #define FlexSPI2_AMBA_BASE                       (0x14000000u)
  #define FlexSPI2_AMBA_BASE_NS                    (0x4000000u)
  /* FlexSPI2 ASFM address. */
  #define FlexSPI2_ASFM_BASE                       (0x14000000u)
  #define FlexSPI2_ASFM_BASE_NS                    (0x4000000u)
  /* Base Address of AHB address space mapped to IP RX FIFO. */
  #define FlexSPI2_ARDF_BASE                       (0x5DE00000u)
  #define FlexSPI2_ARDF_BASE_NS                    (0x4DE00000u)
  /* Base Address of AHB address space mapped to IP TX FIFO. */
  #define FlexSPI2_ATDF_BASE                       (0x5DE10000u)
  #define FlexSPI2_ATDF_BASE_NS                    (0x4DE10000u)
#else
  /* FlexSPI AMBA base address array. */
  #define FlexSPI_AMBA_BASE_ARRAY                  { {0u, 0u}, {0x28000000u, 0x2000000u}, {0x4000000u, 0x22000000u} }
  /* FlexSPI AMBA end address array. */
  #define FlexSPI_AMBA_END_ARRAY                   { {0u, 0u}, {0x2FFFFFFFu, 0x3FFFFFFu}, {0x7FFFFFFu, 0x23FFFFFFu} }
  /* FlexSPI1 AMBA address. */
  #define FlexSPI1_AMBA_BASE                       (0x28000000u)
  /* FlexSPI1 ASFM address. */
  #define FlexSPI1_ASFM_BASE                       (0x28000000u)
  /* Base Address of AHB address space mapped to IP RX FIFO. */
  #define FlexSPI1_ARDF_BASE                       (0x47420000u)
  /* Base Address of AHB address space mapped to IP TX FIFO. */
  #define FlexSPI1_ATDF_BASE                       (0x47430000u)
  /* FlexSPI2 AMBA address. */
  #define FlexSPI2_AMBA_BASE                       (0x4000000u)
  /* FlexSPI2 ASFM address. */
  #define FlexSPI2_ASFM_BASE                       (0x4000000u)
  /* Base Address of AHB address space mapped to IP RX FIFO. */
  #define FlexSPI2_ARDF_BASE                       (0x4DE00000u)
  /* Base Address of AHB address space mapped to IP TX FIFO. */
  #define FlexSPI2_ATDF_BASE                       (0x4DE10000u)
#endif


/* FLEXSPI_SLV - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral FLEXSPI_SLV base address */
  #define FLEXSPI_SLV_BASE                         (0x52900000u)
  /** Peripheral FLEXSPI_SLV base address */
  #define FLEXSPI_SLV_BASE_NS                      (0x42900000u)
  /** Peripheral FLEXSPI_SLV base pointer */
  #define FLEXSPI_SLV                              ((FLEXSPI_SLV_Type *)FLEXSPI_SLV_BASE)
  /** Peripheral FLEXSPI_SLV base pointer */
  #define FLEXSPI_SLV_NS                           ((FLEXSPI_SLV_Type *)FLEXSPI_SLV_BASE_NS)
  /** Array initializer of FLEXSPI_SLV peripheral base addresses */
  #define FLEXSPI_SLV_BASE_ADDRS                   { FLEXSPI_SLV_BASE }
  /** Array initializer of FLEXSPI_SLV peripheral base pointers */
  #define FLEXSPI_SLV_BASE_PTRS                    { FLEXSPI_SLV }
  /** Array initializer of FLEXSPI_SLV peripheral base addresses */
  #define FLEXSPI_SLV_BASE_ADDRS_NS                { FLEXSPI_SLV_BASE_NS }
  /** Array initializer of FLEXSPI_SLV peripheral base pointers */
  #define FLEXSPI_SLV_BASE_PTRS_NS                 { FLEXSPI_SLV_NS }
#else
  /** Peripheral FLEXSPI_SLV base address */
  #define FLEXSPI_SLV_BASE                         (0x42900000u)
  /** Peripheral FLEXSPI_SLV base pointer */
  #define FLEXSPI_SLV                              ((FLEXSPI_SLV_Type *)FLEXSPI_SLV_BASE)
  /** Array initializer of FLEXSPI_SLV peripheral base addresses */
  #define FLEXSPI_SLV_BASE_ADDRS                   { FLEXSPI_SLV_BASE }
  /** Array initializer of FLEXSPI_SLV peripheral base pointers */
  #define FLEXSPI_SLV_BASE_PTRS                    { FLEXSPI_SLV }
#endif
/** Interrupt vectors for the FLEXSPI_SLV peripheral type */
#define FLEXSPI_SLV_IRQS                         { FLEXSPI_SLV_IRQn }

/* GPC_CPU_CTRL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral GPC_CPU_CTRL base address */
  #define GPC_CPU_CTRL_BASE                        (0x54470000u)
  /** Peripheral GPC_CPU_CTRL base address */
  #define GPC_CPU_CTRL_BASE_NS                     (0x44470000u)
  /** Peripheral GPC_CPU_CTRL base pointer */
  #define GPC_CPU_CTRL                             ((GPC_CPU_CTRL_Type *)GPC_CPU_CTRL_BASE)
  /** Peripheral GPC_CPU_CTRL base pointer */
  #define GPC_CPU_CTRL_NS                          ((GPC_CPU_CTRL_Type *)GPC_CPU_CTRL_BASE_NS)
  /** Array initializer of GPC_CPU_CTRL peripheral base addresses */
  #define GPC_CPU_CTRL_BASE_ADDRS                  { GPC_CPU_CTRL_BASE }
  /** Array initializer of GPC_CPU_CTRL peripheral base pointers */
  #define GPC_CPU_CTRL_BASE_PTRS                   { GPC_CPU_CTRL }
  /** Array initializer of GPC_CPU_CTRL peripheral base addresses */
  #define GPC_CPU_CTRL_BASE_ADDRS_NS               { GPC_CPU_CTRL_BASE_NS }
  /** Array initializer of GPC_CPU_CTRL peripheral base pointers */
  #define GPC_CPU_CTRL_BASE_PTRS_NS                { GPC_CPU_CTRL_NS }
#else
  /** Peripheral GPC_CPU_CTRL base address */
  #define GPC_CPU_CTRL_BASE                        (0x44470000u)
  /** Peripheral GPC_CPU_CTRL base pointer */
  #define GPC_CPU_CTRL                             ((GPC_CPU_CTRL_Type *)GPC_CPU_CTRL_BASE)
  /** Array initializer of GPC_CPU_CTRL peripheral base addresses */
  #define GPC_CPU_CTRL_BASE_ADDRS                  { GPC_CPU_CTRL_BASE }
  /** Array initializer of GPC_CPU_CTRL peripheral base pointers */
  #define GPC_CPU_CTRL_BASE_PTRS                   { GPC_CPU_CTRL }
#endif

/* GPC_GLOBAL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral GPC_GLOBAL base address */
  #define GPC_GLOBAL_BASE                          (0x54472000u)
  /** Peripheral GPC_GLOBAL base address */
  #define GPC_GLOBAL_BASE_NS                       (0x44472000u)
  /** Peripheral GPC_GLOBAL base pointer */
  #define GPC_GLOBAL                               ((GPC_GLOBAL_Type *)GPC_GLOBAL_BASE)
  /** Peripheral GPC_GLOBAL base pointer */
  #define GPC_GLOBAL_NS                            ((GPC_GLOBAL_Type *)GPC_GLOBAL_BASE_NS)
  /** Array initializer of GPC_GLOBAL peripheral base addresses */
  #define GPC_GLOBAL_BASE_ADDRS                    { GPC_GLOBAL_BASE }
  /** Array initializer of GPC_GLOBAL peripheral base pointers */
  #define GPC_GLOBAL_BASE_PTRS                     { GPC_GLOBAL }
  /** Array initializer of GPC_GLOBAL peripheral base addresses */
  #define GPC_GLOBAL_BASE_ADDRS_NS                 { GPC_GLOBAL_BASE_NS }
  /** Array initializer of GPC_GLOBAL peripheral base pointers */
  #define GPC_GLOBAL_BASE_PTRS_NS                  { GPC_GLOBAL_NS }
#else
  /** Peripheral GPC_GLOBAL base address */
  #define GPC_GLOBAL_BASE                          (0x44472000u)
  /** Peripheral GPC_GLOBAL base pointer */
  #define GPC_GLOBAL                               ((GPC_GLOBAL_Type *)GPC_GLOBAL_BASE)
  /** Array initializer of GPC_GLOBAL peripheral base addresses */
  #define GPC_GLOBAL_BASE_ADDRS                    { GPC_GLOBAL_BASE }
  /** Array initializer of GPC_GLOBAL peripheral base pointers */
  #define GPC_GLOBAL_BASE_PTRS                     { GPC_GLOBAL }
#endif

/* GPC_SYS_SLEEP_CTRL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral GPC_SYS_SLEEP_CTRL base address */
  #define GPC_SYS_SLEEP_CTRL_BASE                  (0x54472800u)
  /** Peripheral GPC_SYS_SLEEP_CTRL base address */
  #define GPC_SYS_SLEEP_CTRL_BASE_NS               (0x44472800u)
  /** Peripheral GPC_SYS_SLEEP_CTRL base pointer */
  #define GPC_SYS_SLEEP_CTRL                       ((GPC_SYS_SLEEP_CTRL_Type *)GPC_SYS_SLEEP_CTRL_BASE)
  /** Peripheral GPC_SYS_SLEEP_CTRL base pointer */
  #define GPC_SYS_SLEEP_CTRL_NS                    ((GPC_SYS_SLEEP_CTRL_Type *)GPC_SYS_SLEEP_CTRL_BASE_NS)
  /** Array initializer of GPC_SYS_SLEEP_CTRL peripheral base addresses */
  #define GPC_SYS_SLEEP_CTRL_BASE_ADDRS            { GPC_SYS_SLEEP_CTRL_BASE }
  /** Array initializer of GPC_SYS_SLEEP_CTRL peripheral base pointers */
  #define GPC_SYS_SLEEP_CTRL_BASE_PTRS             { GPC_SYS_SLEEP_CTRL }
  /** Array initializer of GPC_SYS_SLEEP_CTRL peripheral base addresses */
  #define GPC_SYS_SLEEP_CTRL_BASE_ADDRS_NS         { GPC_SYS_SLEEP_CTRL_BASE_NS }
  /** Array initializer of GPC_SYS_SLEEP_CTRL peripheral base pointers */
  #define GPC_SYS_SLEEP_CTRL_BASE_PTRS_NS          { GPC_SYS_SLEEP_CTRL_NS }
#else
  /** Peripheral GPC_SYS_SLEEP_CTRL base address */
  #define GPC_SYS_SLEEP_CTRL_BASE                  (0x44472800u)
  /** Peripheral GPC_SYS_SLEEP_CTRL base pointer */
  #define GPC_SYS_SLEEP_CTRL                       ((GPC_SYS_SLEEP_CTRL_Type *)GPC_SYS_SLEEP_CTRL_BASE)
  /** Array initializer of GPC_SYS_SLEEP_CTRL peripheral base addresses */
  #define GPC_SYS_SLEEP_CTRL_BASE_ADDRS            { GPC_SYS_SLEEP_CTRL_BASE }
  /** Array initializer of GPC_SYS_SLEEP_CTRL peripheral base pointers */
  #define GPC_SYS_SLEEP_CTRL_BASE_PTRS             { GPC_SYS_SLEEP_CTRL }
#endif

