zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT118C/MIMXRT118C_cm33_COMMON.h
/* IEE_APC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral IEE_APC base address */
  #define IEE_APC_BASE                             (0x52E44000u)
  /** Peripheral IEE_APC base address */
  #define IEE_APC_BASE_NS                          (0x42E44000u)
  /** Peripheral IEE_APC base pointer */
  #define IEE_APC                                  ((IEE_APC_Type *)IEE_APC_BASE)
  /** Peripheral IEE_APC base pointer */
  #define IEE_APC_NS                               ((IEE_APC_Type *)IEE_APC_BASE_NS)
  /** Array initializer of IEE_APC peripheral base addresses */
  #define IEE_APC_BASE_ADDRS                       { IEE_APC_BASE }
  /** Array initializer of IEE_APC peripheral base pointers */
  #define IEE_APC_BASE_PTRS                        { IEE_APC }
  /** Array initializer of IEE_APC peripheral base addresses */
  #define IEE_APC_BASE_ADDRS_NS                    { IEE_APC_BASE_NS }
  /** Array initializer of IEE_APC peripheral base pointers */
  #define IEE_APC_BASE_PTRS_NS                     { IEE_APC_NS }
#else
  /** Peripheral IEE_APC base address */
  #define IEE_APC_BASE                             (0x42E44000u)
  /** Peripheral IEE_APC base pointer */
  #define IEE_APC                                  ((IEE_APC_Type *)IEE_APC_BASE)
  /** Array initializer of IEE_APC peripheral base addresses */
  #define IEE_APC_BASE_ADDRS                       { IEE_APC_BASE }
  /** Array initializer of IEE_APC peripheral base pointers */
  #define IEE_APC_BASE_PTRS                        { IEE_APC }
#endif

/* IERC_IERB - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral IERC_IERB base address */
  #define IERC_IERB_BASE                           (0x70810000u)
  /** Peripheral IERC_IERB base address */
  #define IERC_IERB_BASE_NS                        (0x60810000u)
  /** Peripheral IERC_IERB base pointer */
  #define IERC_IERB                                ((IERC_IERB_Type *)IERC_IERB_BASE)
  /** Peripheral IERC_IERB base pointer */
  #define IERC_IERB_NS                             ((IERC_IERB_Type *)IERC_IERB_BASE_NS)
  /** Array initializer of IERC_IERB peripheral base addresses */
  #define IERC_IERB_BASE_ADDRS                     { IERC_IERB_BASE }
  /** Array initializer of IERC_IERB peripheral base pointers */
  #define IERC_IERB_BASE_PTRS                      { IERC_IERB }
  /** Array initializer of IERC_IERB peripheral base addresses */
  #define IERC_IERB_BASE_ADDRS_NS                  { IERC_IERB_BASE_NS }
  /** Array initializer of IERC_IERB peripheral base pointers */
  #define IERC_IERB_BASE_PTRS_NS                   { IERC_IERB_NS }
#else
  /** Peripheral IERC_IERB base address */
  #define IERC_IERB_BASE                           (0x60810000u)
  /** Peripheral IERC_IERB base pointer */
  #define IERC_IERB                                ((IERC_IERB_Type *)IERC_IERB_BASE)
  /** Array initializer of IERC_IERB peripheral base addresses */
  #define IERC_IERB_BASE_ADDRS                     { IERC_IERB_BASE }
  /** Array initializer of IERC_IERB peripheral base pointers */
  #define IERC_IERB_BASE_PTRS                      { IERC_IERB }
#endif

/* IERC_PCI - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral IERC_F0_PCI_HDR_TYPE0 base address */
  #define IERC_F0_PCI_HDR_TYPE0_BASE               (0x700F8000u)
  /** Peripheral IERC_F0_PCI_HDR_TYPE0 base address */
  #define IERC_F0_PCI_HDR_TYPE0_BASE_NS            (0x600F8000u)
  /** Peripheral IERC_F0_PCI_HDR_TYPE0 base pointer */
  #define IERC_F0_PCI_HDR_TYPE0                    ((IERC_PCI_Type *)IERC_F0_PCI_HDR_TYPE0_BASE)
  /** Peripheral IERC_F0_PCI_HDR_TYPE0 base pointer */
  #define IERC_F0_PCI_HDR_TYPE0_NS                 ((IERC_PCI_Type *)IERC_F0_PCI_HDR_TYPE0_BASE_NS)
  /** Array initializer of IERC_PCI peripheral base addresses */
  #define IERC_PCI_BASE_ADDRS                      { IERC_F0_PCI_HDR_TYPE0_BASE }
  /** Array initializer of IERC_PCI peripheral base pointers */
  #define IERC_PCI_BASE_PTRS                       { IERC_F0_PCI_HDR_TYPE0 }
  /** Array initializer of IERC_PCI peripheral base addresses */
  #define IERC_PCI_BASE_ADDRS_NS                   { IERC_F0_PCI_HDR_TYPE0_BASE_NS }
  /** Array initializer of IERC_PCI peripheral base pointers */
  #define IERC_PCI_BASE_PTRS_NS                    { IERC_F0_PCI_HDR_TYPE0_NS }
#else
  /** Peripheral IERC_F0_PCI_HDR_TYPE0 base address */
  #define IERC_F0_PCI_HDR_TYPE0_BASE               (0x600F8000u)
  /** Peripheral IERC_F0_PCI_HDR_TYPE0 base pointer */
  #define IERC_F0_PCI_HDR_TYPE0                    ((IERC_PCI_Type *)IERC_F0_PCI_HDR_TYPE0_BASE)
  /** Array initializer of IERC_PCI peripheral base addresses */
  #define IERC_PCI_BASE_ADDRS                      { IERC_F0_PCI_HDR_TYPE0_BASE }
  /** Array initializer of IERC_PCI peripheral base pointers */
  #define IERC_PCI_BASE_PTRS                       { IERC_F0_PCI_HDR_TYPE0 }
#endif

/* IOMUXC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral IOMUXC base address */
  #define IOMUXC_BASE                              (0x52A10000u)
  /** Peripheral IOMUXC base address */
  #define IOMUXC_BASE_NS                           (0x42A10000u)
  /** Peripheral IOMUXC base pointer */
  #define IOMUXC                                   ((IOMUXC_Type *)IOMUXC_BASE)
  /** Peripheral IOMUXC base pointer */
  #define IOMUXC_NS                                ((IOMUXC_Type *)IOMUXC_BASE_NS)
  /** Array initializer of IOMUXC peripheral base addresses */
  #define IOMUXC_BASE_ADDRS                        { IOMUXC_BASE }
  /** Array initializer of IOMUXC peripheral base pointers */
  #define IOMUXC_BASE_PTRS                         { IOMUXC }
  /** Array initializer of IOMUXC peripheral base addresses */
  #define IOMUXC_BASE_ADDRS_NS                     { IOMUXC_BASE_NS }
  /** Array initializer of IOMUXC peripheral base pointers */
  #define IOMUXC_BASE_PTRS_NS                      { IOMUXC_NS }
#else
  /** Peripheral IOMUXC base address */
  #define IOMUXC_BASE                              (0x42A10000u)
  /** Peripheral IOMUXC base pointer */
  #define IOMUXC                                   ((IOMUXC_Type *)IOMUXC_BASE)
  /** Array initializer of IOMUXC peripheral base addresses */
  #define IOMUXC_BASE_ADDRS                        { IOMUXC_BASE }
  /** Array initializer of IOMUXC peripheral base pointers */
  #define IOMUXC_BASE_PTRS                         { IOMUXC }
#endif

/* IOMUXC_AON - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral IOMUXC_AON base address */
  #define IOMUXC_AON_BASE                          (0x543C0000u)
  /** Peripheral IOMUXC_AON base address */
  #define IOMUXC_AON_BASE_NS                       (0x443C0000u)
  /** Peripheral IOMUXC_AON base pointer */
  #define IOMUXC_AON                               ((IOMUXC_AON_Type *)IOMUXC_AON_BASE)
  /** Peripheral IOMUXC_AON base pointer */
  #define IOMUXC_AON_NS                            ((IOMUXC_AON_Type *)IOMUXC_AON_BASE_NS)
  /** Array initializer of IOMUXC_AON peripheral base addresses */
  #define IOMUXC_AON_BASE_ADDRS                    { IOMUXC_AON_BASE }
  /** Array initializer of IOMUXC_AON peripheral base pointers */
  #define IOMUXC_AON_BASE_PTRS                     { IOMUXC_AON }
  /** Array initializer of IOMUXC_AON peripheral base addresses */
  #define IOMUXC_AON_BASE_ADDRS_NS                 { IOMUXC_AON_BASE_NS }
  /** Array initializer of IOMUXC_AON peripheral base pointers */
  #define IOMUXC_AON_BASE_PTRS_NS                  { IOMUXC_AON_NS }
#else
  /** Peripheral IOMUXC_AON base address */
  #define IOMUXC_AON_BASE                          (0x443C0000u)
  /** Peripheral IOMUXC_AON base pointer */
  #define IOMUXC_AON                               ((IOMUXC_AON_Type *)IOMUXC_AON_BASE)
  /** Array initializer of IOMUXC_AON peripheral base addresses */
  #define IOMUXC_AON_BASE_ADDRS                    { IOMUXC_AON_BASE }
  /** Array initializer of IOMUXC_AON peripheral base pointers */
  #define IOMUXC_AON_BASE_PTRS                     { IOMUXC_AON }
#endif

