zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT118C/MIMXRT118C_cm33_COMMON.h
/* RTWDOG - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral RTWDOG1 base address */
  #define RTWDOG1_BASE                             (0x542D0000u)
  /** Peripheral RTWDOG1 base address */
  #define RTWDOG1_BASE_NS                          (0x442D0000u)
  /** Peripheral RTWDOG1 base pointer */
  #define RTWDOG1                                  ((RTWDOG_Type *)RTWDOG1_BASE)
  /** Peripheral RTWDOG1 base pointer */
  #define RTWDOG1_NS                               ((RTWDOG_Type *)RTWDOG1_BASE_NS)
  /** Peripheral RTWDOG2 base address */
  #define RTWDOG2_BASE                             (0x542E0000u)
  /** Peripheral RTWDOG2 base address */
  #define RTWDOG2_BASE_NS                          (0x442E0000u)
  /** Peripheral RTWDOG2 base pointer */
  #define RTWDOG2                                  ((RTWDOG_Type *)RTWDOG2_BASE)
  /** Peripheral RTWDOG2 base pointer */
  #define RTWDOG2_NS                               ((RTWDOG_Type *)RTWDOG2_BASE_NS)
  /** Peripheral RTWDOG3 base address */
  #define RTWDOG3_BASE                             (0x52490000u)
  /** Peripheral RTWDOG3 base address */
  #define RTWDOG3_BASE_NS                          (0x42490000u)
  /** Peripheral RTWDOG3 base pointer */
  #define RTWDOG3                                  ((RTWDOG_Type *)RTWDOG3_BASE)
  /** Peripheral RTWDOG3 base pointer */
  #define RTWDOG3_NS                               ((RTWDOG_Type *)RTWDOG3_BASE_NS)
  /** Peripheral RTWDOG4 base address */
  #define RTWDOG4_BASE                             (0x524A0000u)
  /** Peripheral RTWDOG4 base address */
  #define RTWDOG4_BASE_NS                          (0x424A0000u)
  /** Peripheral RTWDOG4 base pointer */
  #define RTWDOG4                                  ((RTWDOG_Type *)RTWDOG4_BASE)
  /** Peripheral RTWDOG4 base pointer */
  #define RTWDOG4_NS                               ((RTWDOG_Type *)RTWDOG4_BASE_NS)
  /** Peripheral RTWDOG5 base address */
  #define RTWDOG5_BASE                             (0x524B0000u)
  /** Peripheral RTWDOG5 base address */
  #define RTWDOG5_BASE_NS                          (0x424B0000u)
  /** Peripheral RTWDOG5 base pointer */
  #define RTWDOG5                                  ((RTWDOG_Type *)RTWDOG5_BASE)
  /** Peripheral RTWDOG5 base pointer */
  #define RTWDOG5_NS                               ((RTWDOG_Type *)RTWDOG5_BASE_NS)
  /** Array initializer of RTWDOG peripheral base addresses */
  #define RTWDOG_BASE_ADDRS                        { 0u, RTWDOG1_BASE, RTWDOG2_BASE, RTWDOG3_BASE, RTWDOG4_BASE, RTWDOG5_BASE }
  /** Array initializer of RTWDOG peripheral base pointers */
  #define RTWDOG_BASE_PTRS                         { (RTWDOG_Type *)0u, RTWDOG1, RTWDOG2, RTWDOG3, RTWDOG4, RTWDOG5 }
  /** Array initializer of RTWDOG peripheral base addresses */
  #define RTWDOG_BASE_ADDRS_NS                     { 0u, RTWDOG1_BASE_NS, RTWDOG2_BASE_NS, RTWDOG3_BASE_NS, RTWDOG4_BASE_NS, RTWDOG5_BASE_NS }
  /** Array initializer of RTWDOG peripheral base pointers */
  #define RTWDOG_BASE_PTRS_NS                      { (RTWDOG_Type *)0u, RTWDOG1_NS, RTWDOG2_NS, RTWDOG3_NS, RTWDOG4_NS, RTWDOG5_NS }
#else
  /** Peripheral RTWDOG1 base address */
  #define RTWDOG1_BASE                             (0x442D0000u)
  /** Peripheral RTWDOG1 base pointer */
  #define RTWDOG1                                  ((RTWDOG_Type *)RTWDOG1_BASE)
  /** Peripheral RTWDOG2 base address */
  #define RTWDOG2_BASE                             (0x442E0000u)
  /** Peripheral RTWDOG2 base pointer */
  #define RTWDOG2                                  ((RTWDOG_Type *)RTWDOG2_BASE)
  /** Peripheral RTWDOG3 base address */
  #define RTWDOG3_BASE                             (0x42490000u)
  /** Peripheral RTWDOG3 base pointer */
  #define RTWDOG3                                  ((RTWDOG_Type *)RTWDOG3_BASE)
  /** Peripheral RTWDOG4 base address */
  #define RTWDOG4_BASE                             (0x424A0000u)
  /** Peripheral RTWDOG4 base pointer */
  #define RTWDOG4                                  ((RTWDOG_Type *)RTWDOG4_BASE)
  /** Peripheral RTWDOG5 base address */
  #define RTWDOG5_BASE                             (0x424B0000u)
  /** Peripheral RTWDOG5 base pointer */
  #define RTWDOG5                                  ((RTWDOG_Type *)RTWDOG5_BASE)
  /** Array initializer of RTWDOG peripheral base addresses */
  #define RTWDOG_BASE_ADDRS                        { 0u, RTWDOG1_BASE, RTWDOG2_BASE, RTWDOG3_BASE, RTWDOG4_BASE, RTWDOG5_BASE }
  /** Array initializer of RTWDOG peripheral base pointers */
  #define RTWDOG_BASE_PTRS                         { (RTWDOG_Type *)0u, RTWDOG1, RTWDOG2, RTWDOG3, RTWDOG4, RTWDOG5 }
#endif
/** Interrupt vectors for the RTWDOG peripheral type */
#define RTWDOG_IRQS                              { NotAvail_IRQn, RTWDOG1_IRQn, RTWDOG2_IRQn, RTWDOG3_IRQn, RTWDOG4_IRQn, RTWDOG5_IRQn }
/* Extra definition */
#define RTWDOG_UPDATE_KEY                        (0xD928C520U)
#define RTWDOG_REFRESH_KEY                       (0xB480A602U)


/* S3MU - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MU_APPS_S3MUA base address */
  #define MU_APPS_S3MUA_BASE                       (0x57520000u)
  /** Peripheral MU_APPS_S3MUA base address */
  #define MU_APPS_S3MUA_BASE_NS                    (0x47520000u)
  /** Peripheral MU_APPS_S3MUA base pointer */
  #define MU_APPS_S3MUA                            ((S3MU_Type *)MU_APPS_S3MUA_BASE)
  /** Peripheral MU_APPS_S3MUA base pointer */
  #define MU_APPS_S3MUA_NS                         ((S3MU_Type *)MU_APPS_S3MUA_BASE_NS)
  /** Peripheral MU_RT_S3MUA base address */
  #define MU_RT_S3MUA_BASE                         (0x57540000u)
  /** Peripheral MU_RT_S3MUA base address */
  #define MU_RT_S3MUA_BASE_NS                      (0x47540000u)
  /** Peripheral MU_RT_S3MUA base pointer */
  #define MU_RT_S3MUA                              ((S3MU_Type *)MU_RT_S3MUA_BASE)
  /** Peripheral MU_RT_S3MUA base pointer */
  #define MU_RT_S3MUA_NS                           ((S3MU_Type *)MU_RT_S3MUA_BASE_NS)
  /** Array initializer of S3MU peripheral base addresses */
  #define S3MU_BASE_ADDRS                          { MU_APPS_S3MUA_BASE, MU_RT_S3MUA_BASE }
  /** Array initializer of S3MU peripheral base pointers */
  #define S3MU_BASE_PTRS                           { MU_APPS_S3MUA, MU_RT_S3MUA }
  /** Array initializer of S3MU peripheral base addresses */
  #define S3MU_BASE_ADDRS_NS                       { MU_APPS_S3MUA_BASE_NS, MU_RT_S3MUA_BASE_NS }
  /** Array initializer of S3MU peripheral base pointers */
  #define S3MU_BASE_PTRS_NS                        { MU_APPS_S3MUA_NS, MU_RT_S3MUA_NS }
#else
  /** Peripheral MU_APPS_S3MUA base address */
  #define MU_APPS_S3MUA_BASE                       (0x47520000u)
  /** Peripheral MU_APPS_S3MUA base pointer */
  #define MU_APPS_S3MUA                            ((S3MU_Type *)MU_APPS_S3MUA_BASE)
  /** Peripheral MU_RT_S3MUA base address */
  #define MU_RT_S3MUA_BASE                         (0x47540000u)
  /** Peripheral MU_RT_S3MUA base pointer */
  #define MU_RT_S3MUA                              ((S3MU_Type *)MU_RT_S3MUA_BASE)
  /** Array initializer of S3MU peripheral base addresses */
  #define S3MU_BASE_ADDRS                          { MU_APPS_S3MUA_BASE, MU_RT_S3MUA_BASE }
  /** Array initializer of S3MU peripheral base pointers */
  #define S3MU_BASE_PTRS                           { MU_APPS_S3MUA, MU_RT_S3MUA }
#endif

/* SEMA42 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SEMA1 base address */
  #define SEMA1_BASE                               (0x54260000u)
  /** Peripheral SEMA1 base address */
  #define SEMA1_BASE_NS                            (0x44260000u)
  /** Peripheral SEMA1 base pointer */
  #define SEMA1                                    ((SEMA42_Type *)SEMA1_BASE)
  /** Peripheral SEMA1 base pointer */
  #define SEMA1_NS                                 ((SEMA42_Type *)SEMA1_BASE_NS)
  /** Peripheral SEMA2 base address */
  #define SEMA2_BASE                               (0x52450000u)
  /** Peripheral SEMA2 base address */
  #define SEMA2_BASE_NS                            (0x42450000u)
  /** Peripheral SEMA2 base pointer */
  #define SEMA2                                    ((SEMA42_Type *)SEMA2_BASE)
  /** Peripheral SEMA2 base pointer */
  #define SEMA2_NS                                 ((SEMA42_Type *)SEMA2_BASE_NS)
  /** Array initializer of SEMA42 peripheral base addresses */
  #define SEMA42_BASE_ADDRS                        { SEMA1_BASE, SEMA2_BASE }
  /** Array initializer of SEMA42 peripheral base pointers */
  #define SEMA42_BASE_PTRS                         { SEMA1, SEMA2 }
  /** Array initializer of SEMA42 peripheral base addresses */
  #define SEMA42_BASE_ADDRS_NS                     { SEMA1_BASE_NS, SEMA2_BASE_NS }
  /** Array initializer of SEMA42 peripheral base pointers */
  #define SEMA42_BASE_PTRS_NS                      { SEMA1_NS, SEMA2_NS }
#else
  /** Peripheral SEMA1 base address */
  #define SEMA1_BASE                               (0x44260000u)
  /** Peripheral SEMA1 base pointer */
  #define SEMA1                                    ((SEMA42_Type *)SEMA1_BASE)
  /** Peripheral SEMA2 base address */
  #define SEMA2_BASE                               (0x42450000u)
  /** Peripheral SEMA2 base pointer */
  #define SEMA2                                    ((SEMA42_Type *)SEMA2_BASE)
  /** Array initializer of SEMA42 peripheral base addresses */
  #define SEMA42_BASE_ADDRS                        { SEMA1_BASE, SEMA2_BASE }
  /** Array initializer of SEMA42 peripheral base pointers */
  #define SEMA42_BASE_PTRS                         { SEMA1, SEMA2 }
#endif

/* SEMC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SEMC base address */
  #define SEMC_BASE                                (0x52910000u)
  /** Peripheral SEMC base address */
  #define SEMC_BASE_NS                             (0x42910000u)
  /** Peripheral SEMC base pointer */
  #define SEMC                                     ((SEMC_Type *)SEMC_BASE)
  /** Peripheral SEMC base pointer */
  #define SEMC_NS                                  ((SEMC_Type *)SEMC_BASE_NS)
  /** Array initializer of SEMC peripheral base addresses */
  #define SEMC_BASE_ADDRS                          { SEMC_BASE }
  /** Array initializer of SEMC peripheral base pointers */
  #define SEMC_BASE_PTRS                           { SEMC }
  /** Array initializer of SEMC peripheral base addresses */
  #define SEMC_BASE_ADDRS_NS                       { SEMC_BASE_NS }
  /** Array initializer of SEMC peripheral base pointers */
  #define SEMC_BASE_PTRS_NS                        { SEMC_NS }
#else
  /** Peripheral SEMC base address */
  #define SEMC_BASE                                (0x42910000u)
  /** Peripheral SEMC base pointer */
  #define SEMC                                     ((SEMC_Type *)SEMC_BASE)
  /** Array initializer of SEMC peripheral base addresses */
  #define SEMC_BASE_ADDRS                          { SEMC_BASE }
  /** Array initializer of SEMC peripheral base pointers */
  #define SEMC_BASE_PTRS                           { SEMC }
#endif
/** Interrupt vectors for the SEMC peripheral type */
#define SEMC_IRQS                                { SEMC_IRQn }

/* SINC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SINC1 base address */
  #define SINC1_BASE                               (0x52BF0000u)
  /** Peripheral SINC1 base address */
  #define SINC1_BASE_NS                            (0x42BF0000u)
  /** Peripheral SINC1 base pointer */
  #define SINC1                                    ((SINC_Type *)SINC1_BASE)
  /** Peripheral SINC1 base pointer */
  #define SINC1_NS                                 ((SINC_Type *)SINC1_BASE_NS)
  /** Peripheral SINC2 base address */
  #define SINC2_BASE                               (0x52C00000u)
  /** Peripheral SINC2 base address */
  #define SINC2_BASE_NS                            (0x42C00000u)
  /** Peripheral SINC2 base pointer */
  #define SINC2                                    ((SINC_Type *)SINC2_BASE)
  /** Peripheral SINC2 base pointer */
  #define SINC2_NS                                 ((SINC_Type *)SINC2_BASE_NS)
  /** Peripheral SINC3 base address */
  #define SINC3_BASE                               (0x52C10000u)
  /** Peripheral SINC3 base address */
  #define SINC3_BASE_NS                            (0x42C10000u)
  /** Peripheral SINC3 base pointer */
  #define SINC3                                    ((SINC_Type *)SINC3_BASE)
  /** Peripheral SINC3 base pointer */
  #define SINC3_NS                                 ((SINC_Type *)SINC3_BASE_NS)
  /** Array initializer of SINC peripheral base addresses */
  #define SINC_BASE_ADDRS                          { 0u, SINC1_BASE, SINC2_BASE, SINC3_BASE }
  /** Array initializer of SINC peripheral base pointers */
  #define SINC_BASE_PTRS                           { (SINC_Type *)0u, SINC1, SINC2, SINC3 }
  /** Array initializer of SINC peripheral base addresses */
  #define SINC_BASE_ADDRS_NS                       { 0u, SINC1_BASE_NS, SINC2_BASE_NS, SINC3_BASE_NS }
  /** Array initializer of SINC peripheral base pointers */
  #define SINC_BASE_PTRS_NS                        { (SINC_Type *)0u, SINC1_NS, SINC2_NS, SINC3_NS }
#else
  /** Peripheral SINC1 base address */
  #define SINC1_BASE                               (0x42BF0000u)
  /** Peripheral SINC1 base pointer */
  #define SINC1                                    ((SINC_Type *)SINC1_BASE)
  /** Peripheral SINC2 base address */
  #define SINC2_BASE                               (0x42C00000u)
  /** Peripheral SINC2 base pointer */
  #define SINC2                                    ((SINC_Type *)SINC2_BASE)
  /** Peripheral SINC3 base address */
  #define SINC3_BASE                               (0x42C10000u)
  /** Peripheral SINC3 base pointer */
  #define SINC3                                    ((SINC_Type *)SINC3_BASE)
  /** Array initializer of SINC peripheral base addresses */
  #define SINC_BASE_ADDRS                          { 0u, SINC1_BASE, SINC2_BASE, SINC3_BASE }
  /** Array initializer of SINC peripheral base pointers */
  #define SINC_BASE_PTRS                           { (SINC_Type *)0u, SINC1, SINC2, SINC3 }
#endif
/** Interrupt vectors for the SINC peripheral type */
#define SINC_IRQS                                { { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn }, { SINC1_CH0_IRQn, SINC1_CH1_IRQn, SINC1_CH2_IRQn, SINC1_CH3_IRQn }, { SINC2_CH0_IRQn, SINC2_CH1_IRQn, SINC2_CH2_IRQn, SINC2_CH3_IRQn }, { SINC3_CH0_CH1_CH2_CH3_IRQn, SINC3_CH0_CH1_CH2_CH3_IRQn, SINC3_CH0_CH1_CH2_CH3_IRQn, SINC3_CH0_CH1_CH2_CH3_IRQn } }

/* SPDIF - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SPDIF base address */
  #define SPDIF_BASE                               (0x52BA0000u)
  /** Peripheral SPDIF base address */
  #define SPDIF_BASE_NS                            (0x42BA0000u)
  /** Peripheral SPDIF base pointer */
  #define SPDIF                                    ((SPDIF_Type *)SPDIF_BASE)
  /** Peripheral SPDIF base pointer */
  #define SPDIF_NS                                 ((SPDIF_Type *)SPDIF_BASE_NS)
  /** Array initializer of SPDIF peripheral base addresses */
  #define SPDIF_BASE_ADDRS                         { SPDIF_BASE }
  /** Array initializer of SPDIF peripheral base pointers */
  #define SPDIF_BASE_PTRS                          { SPDIF }
  /** Array initializer of SPDIF peripheral base addresses */
  #define SPDIF_BASE_ADDRS_NS                      { SPDIF_BASE_NS }
  /** Array initializer of SPDIF peripheral base pointers */
  #define SPDIF_BASE_PTRS_NS                       { SPDIF_NS }
#else
  /** Peripheral SPDIF base address */
  #define SPDIF_BASE                               (0x42BA0000u)
  /** Peripheral SPDIF base pointer */
  #define SPDIF                                    ((SPDIF_Type *)SPDIF_BASE)
  /** Array initializer of SPDIF peripheral base addresses */
  #define SPDIF_BASE_ADDRS                         { SPDIF_BASE }
  /** Array initializer of SPDIF peripheral base pointers */
  #define SPDIF_BASE_PTRS                          { SPDIF }
#endif
/** Interrupt vectors for the SPDIF peripheral type */
#define SPDIF_IRQS                               { SPDIF_IRQn }

/* SRC_GENERAL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SRC_GENERAL_REG base address */
  #define SRC_GENERAL_REG_BASE                     (0x54460000u)
  /** Peripheral SRC_GENERAL_REG base address */
  #define SRC_GENERAL_REG_BASE_NS                  (0x44460000u)
  /** Peripheral SRC_GENERAL_REG base pointer */
  #define SRC_GENERAL_REG                          ((SRC_GENERAL_Type *)SRC_GENERAL_REG_BASE)
  /** Peripheral SRC_GENERAL_REG base pointer */
  #define SRC_GENERAL_REG_NS                       ((SRC_GENERAL_Type *)SRC_GENERAL_REG_BASE_NS)
  /** Array initializer of SRC_GENERAL peripheral base addresses */
  #define SRC_GENERAL_BASE_ADDRS                   { SRC_GENERAL_REG_BASE }
  /** Array initializer of SRC_GENERAL peripheral base pointers */
  #define SRC_GENERAL_BASE_PTRS                    { SRC_GENERAL_REG }
  /** Array initializer of SRC_GENERAL peripheral base addresses */
  #define SRC_GENERAL_BASE_ADDRS_NS                { SRC_GENERAL_REG_BASE_NS }
  /** Array initializer of SRC_GENERAL peripheral base pointers */
  #define SRC_GENERAL_BASE_PTRS_NS                 { SRC_GENERAL_REG_NS }
#else
  /** Peripheral SRC_GENERAL_REG base address */
  #define SRC_GENERAL_REG_BASE                     (0x44460000u)
  /** Peripheral SRC_GENERAL_REG base pointer */
  #define SRC_GENERAL_REG                          ((SRC_GENERAL_Type *)SRC_GENERAL_REG_BASE)
  /** Array initializer of SRC_GENERAL peripheral base addresses */
  #define SRC_GENERAL_BASE_ADDRS                   { SRC_GENERAL_REG_BASE }
  /** Array initializer of SRC_GENERAL peripheral base pointers */
  #define SRC_GENERAL_BASE_PTRS                    { SRC_GENERAL_REG }
#endif

/* SRC_MIF_LN28FDSOI_SPLLRAM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AON_MIF_LN28FDSOI_SPLLRAM base address */
  #define AON_MIF_LN28FDSOI_SPLLRAM_BASE           (0x54462400u)
  /** Peripheral AON_MIF_LN28FDSOI_SPLLRAM base address */
  #define AON_MIF_LN28FDSOI_SPLLRAM_BASE_NS        (0x44462400u)
  /** Peripheral AON_MIF_LN28FDSOI_SPLLRAM base pointer */
  #define AON_MIF_LN28FDSOI_SPLLRAM                ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)AON_MIF_LN28FDSOI_SPLLRAM_BASE)
  /** Peripheral AON_MIF_LN28FDSOI_SPLLRAM base pointer */
  #define AON_MIF_LN28FDSOI_SPLLRAM_NS             ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)AON_MIF_LN28FDSOI_SPLLRAM_BASE_NS)
  /** Peripheral WAKEUP_MIF_LN28FDSOI_SPLLRAM base address */
  #define WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE        (0x54462C00u)
  /** Peripheral WAKEUP_MIF_LN28FDSOI_SPLLRAM base address */
  #define WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE_NS     (0x44462C00u)
  /** Peripheral WAKEUP_MIF_LN28FDSOI_SPLLRAM base pointer */
  #define WAKEUP_MIF_LN28FDSOI_SPLLRAM             ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE)
  /** Peripheral WAKEUP_MIF_LN28FDSOI_SPLLRAM base pointer */
  #define WAKEUP_MIF_LN28FDSOI_SPLLRAM_NS          ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE_NS)
  /** Peripheral MEGA_MIF_LN28FDSOI_SPLLRAM base address */
  #define MEGA_MIF_LN28FDSOI_SPLLRAM_BASE          (0x54463400u)
  /** Peripheral MEGA_MIF_LN28FDSOI_SPLLRAM base address */
  #define MEGA_MIF_LN28FDSOI_SPLLRAM_BASE_NS       (0x44463400u)
  /** Peripheral MEGA_MIF_LN28FDSOI_SPLLRAM base pointer */
  #define MEGA_MIF_LN28FDSOI_SPLLRAM               ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)MEGA_MIF_LN28FDSOI_SPLLRAM_BASE)
  /** Peripheral MEGA_MIF_LN28FDSOI_SPLLRAM base pointer */
  #define MEGA_MIF_LN28FDSOI_SPLLRAM_NS            ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)MEGA_MIF_LN28FDSOI_SPLLRAM_BASE_NS)
  /** Peripheral NETC_MIF_LN28FDSOI_SPLLRAM base address */
  #define NETC_MIF_LN28FDSOI_SPLLRAM_BASE          (0x54463C00u)
  /** Peripheral NETC_MIF_LN28FDSOI_SPLLRAM base address */
  #define NETC_MIF_LN28FDSOI_SPLLRAM_BASE_NS       (0x44463C00u)
  /** Peripheral NETC_MIF_LN28FDSOI_SPLLRAM base pointer */
  #define NETC_MIF_LN28FDSOI_SPLLRAM               ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)NETC_MIF_LN28FDSOI_SPLLRAM_BASE)
  /** Peripheral NETC_MIF_LN28FDSOI_SPLLRAM base pointer */
  #define NETC_MIF_LN28FDSOI_SPLLRAM_NS            ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)NETC_MIF_LN28FDSOI_SPLLRAM_BASE_NS)
  /** Array initializer of SRC_MIF_LN28FDSOI_SPLLRAM peripheral base addresses */
  #define SRC_MIF_LN28FDSOI_SPLLRAM_BASE_ADDRS     { AON_MIF_LN28FDSOI_SPLLRAM_BASE, WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE, MEGA_MIF_LN28FDSOI_SPLLRAM_BASE, NETC_MIF_LN28FDSOI_SPLLRAM_BASE }
  /** Array initializer of SRC_MIF_LN28FDSOI_SPLLRAM peripheral base pointers */
  #define SRC_MIF_LN28FDSOI_SPLLRAM_BASE_PTRS      { AON_MIF_LN28FDSOI_SPLLRAM, WAKEUP_MIF_LN28FDSOI_SPLLRAM, MEGA_MIF_LN28FDSOI_SPLLRAM, NETC_MIF_LN28FDSOI_SPLLRAM }
  /** Array initializer of SRC_MIF_LN28FDSOI_SPLLRAM peripheral base addresses */
  #define SRC_MIF_LN28FDSOI_SPLLRAM_BASE_ADDRS_NS  { AON_MIF_LN28FDSOI_SPLLRAM_BASE_NS, WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE_NS, MEGA_MIF_LN28FDSOI_SPLLRAM_BASE_NS, NETC_MIF_LN28FDSOI_SPLLRAM_BASE_NS }
  /** Array initializer of SRC_MIF_LN28FDSOI_SPLLRAM peripheral base pointers */
  #define SRC_MIF_LN28FDSOI_SPLLRAM_BASE_PTRS_NS   { AON_MIF_LN28FDSOI_SPLLRAM_NS, WAKEUP_MIF_LN28FDSOI_SPLLRAM_NS, MEGA_MIF_LN28FDSOI_SPLLRAM_NS, NETC_MIF_LN28FDSOI_SPLLRAM_NS }
#else
  /** Peripheral AON_MIF_LN28FDSOI_SPLLRAM base address */
  #define AON_MIF_LN28FDSOI_SPLLRAM_BASE           (0x44462400u)
  /** Peripheral AON_MIF_LN28FDSOI_SPLLRAM base pointer */
  #define AON_MIF_LN28FDSOI_SPLLRAM                ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)AON_MIF_LN28FDSOI_SPLLRAM_BASE)
  /** Peripheral WAKEUP_MIF_LN28FDSOI_SPLLRAM base address */
  #define WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE        (0x44462C00u)
  /** Peripheral WAKEUP_MIF_LN28FDSOI_SPLLRAM base pointer */
  #define WAKEUP_MIF_LN28FDSOI_SPLLRAM             ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE)
  /** Peripheral MEGA_MIF_LN28FDSOI_SPLLRAM base address */
  #define MEGA_MIF_LN28FDSOI_SPLLRAM_BASE          (0x44463400u)
  /** Peripheral MEGA_MIF_LN28FDSOI_SPLLRAM base pointer */
  #define MEGA_MIF_LN28FDSOI_SPLLRAM               ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)MEGA_MIF_LN28FDSOI_SPLLRAM_BASE)
  /** Peripheral NETC_MIF_LN28FDSOI_SPLLRAM base address */
  #define NETC_MIF_LN28FDSOI_SPLLRAM_BASE          (0x44463C00u)
  /** Peripheral NETC_MIF_LN28FDSOI_SPLLRAM base pointer */
  #define NETC_MIF_LN28FDSOI_SPLLRAM               ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)NETC_MIF_LN28FDSOI_SPLLRAM_BASE)
  /** Array initializer of SRC_MIF_LN28FDSOI_SPLLRAM peripheral base addresses */
  #define SRC_MIF_LN28FDSOI_SPLLRAM_BASE_ADDRS     { AON_MIF_LN28FDSOI_SPLLRAM_BASE, WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE, MEGA_MIF_LN28FDSOI_SPLLRAM_BASE, NETC_MIF_LN28FDSOI_SPLLRAM_BASE }
  /** Array initializer of SRC_MIF_LN28FDSOI_SPLLRAM peripheral base pointers */
  #define SRC_MIF_LN28FDSOI_SPLLRAM_BASE_PTRS      { AON_MIF_LN28FDSOI_SPLLRAM, WAKEUP_MIF_LN28FDSOI_SPLLRAM, MEGA_MIF_LN28FDSOI_SPLLRAM, NETC_MIF_LN28FDSOI_SPLLRAM }
#endif

